tap "buo/cask-upgrade"
tap "dagger/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "ack"
brew "coreutils"
brew "asdf"
brew "gcc"
brew "btop"
brew "cask"
brew "fastfetch"
brew "fzf"
brew "gh"
brew "grpcurl"
brew "htop"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "mas"
brew "ncdu"
brew "pnpm"
brew "postgresql@16"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "thefuck"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "yadm"
brew "yq"
brew "z"
cask "1password"
cask "alacritty"
cask "another-redis-desktop-manager"
cask "battery"
cask "betterdisplay"
cask "bitwarden"
cask "cheatsheet"
cask "cocoarestclient"
cask "hammerspoon"
cask "hiddenbar"
cask "insomnia"
cask "keepingyouawake"
cask "linearmouse"
cask "maccy"
cask "monitorcontrol"
cask "pgadmin4"
cask "postman"
cask "rapidapi"
cask "raycast"
cask "rectangle"
cask "soundsource"
cask "spotify"
cask "tabby"
cask "tomatobar"
cask "visual-studio-code"
cask "waterfox"
cask "zoom"
vscode "chen-zhanming.allogenes"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.docker-explorer"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.vscode-pull-request-github"
vscode "gitworktrees.git-worktrees"
vscode "golang.go"
vscode "hoovercj.vscode-power-mode"
vscode "jgclark.vscode-todo-highlight"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "perfectnkosi.midnight-sun"
vscode "pkief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sleistner.vscode-fileutils"
vscode "spotechyt.serika-dark"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "xyc.vscode-mdx-preview"
vscode "zanza00.random-theme-switcher"
vscode "zevross.font-randomizer"
vscode "zxh404.vscode-proto3"
